# FadeTo Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayDepthCueing..::..FadeTo Property
ViewDisplayDepthCueing Class See Also
---
The fade to defines the maximum fading in per cent. Values between 0 and 100.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int FadeTo { get; set; }
```

Visual Basic
---
```text
Public Property FadeTo As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int FadeTo {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The fade to value is not valid. The valid range is 0 to 100. |

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace